wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
/**************************************************************************//**
 * @file    spim.c
 * @version V1.00
 * @brief   SPIM driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/
#define PHASE_CLR_CMD_Pos               (0)
#define PHASE_CLR_ADDR_Pos              (8)
#define PHASE_CLR_READMODE_Pos          (16)
#define PHASE_CLR_DATA_Pos              (24)

/** @addtogroup SPIM_Driver SPIM Driver
  @{
*/

/** @addtogroup SPIM_EXPORTED_FUNCTIONS SPIM Exported Functions
  @{
*/

/** @cond HIDDEN_SYMBOLS */

#define ENABLE_DEBUG    0

#if ENABLE_DEBUG
    #define SPIM_DBGMSG   printf
#else
    #define SPIM_DBGMSG(...)   do { } while (0)      /* disable debug */
#endif

//------------------------------------------------------------------------------
static volatile uint8_t  g_Supported_List[] =
{
    MFGID_WINBOND,
    MFGID_MXIC,
    MFGID_EON,
    MFGID_ISSI,
    MFGID_SPANSION,
    MFGID_MICRON,
};

//------------------------------------------------------------------------------
static void N_delay(int n);
static void SwitchNBitOutput(SPIM_T *spim, uint32_t u32NBit);
static void SwitchNBitInput(SPIM_T *spim, uint32_t u32NBit);
static int32_t spim_write_data(SPIM_T *spim, uint8_t pu8TxBuf[], uint32_t u32NTx, uint32_t u32NBit);
static int32_t spim_read_data(SPIM_T *spim, uint8_t pu8RxBuf[], uint32_t u32NRx, uint32_t u32NBit);
static void SPIM_WriteStatusRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit);
//static void SPIM_ReadStatusRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit);
static void SPIM_ReadStatusRegister2(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit);
static void SPIM_WriteStatusRegister2(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit);
static void SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit);
static void SPIM_ReadSecurityRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit);
static int spim_is_writedone(SPIM_T *spim, uint32_t u32NBit);
static int32_t spim_wait_writedone(SPIM_T *spim, uint32_t u32NBit);
static void spim_enable_spansion_quad_mode(SPIM_T *spim, int isEn);
static void SPIM_SPANSION_4Bytes_Enable(SPIM_T *spim, int isEn, uint32_t u32NBit);
static void SPIM_WriteInPageDataByIO(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                                     uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t wrCmd,
                                     uint32_t u32NBitCmd, uint32_t u32NBitAddr,
                                     uint32_t u32NBitDat, int isSync);
static int32_t SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                                               uint32_t u32NTx, uint8_t pu8TxBuf[], uint32_t wrCmd, int isSync);
static void spim_clr_contreadphase(SPIM_T *spim, uint32_t u32OPMode);

//------------------------------------------------------------------------------
static void N_delay(int n)
{
    while (n-- > 0)
    {
        __NOP();
    }
}

static void SwitchNBitOutput(SPIM_T *spim, uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case 1UL:
            SPIM_ENABLE_SING_OUTPUT_MODE(spim);     /* 1-bit, Output. */
            break;

        case 2UL:
            SPIM_ENABLE_DUAL_OUTPUT_MODE(spim);     /* 2-bit, Output. */
            break;

        case 4UL:
            SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);     /* 4-bit, Output. */
            break;

        case 8UL:
            SPIM_ENABLE_OCTAL_OUTPUT_MODE(spim);    /* 8-bit, Output. */
            break;

        default:
            break;
    }
}

static void SwitchNBitInput(SPIM_T *spim, uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case 1UL:
            SPIM_ENABLE_SING_INPUT_MODE(spim);      /* 1-bit, Input. */
            break;

        case 2UL:
            SPIM_ENABLE_DUAL_INPUT_MODE(spim);      /* 2-bit, Input. */
            break;

        case 4UL:
            SPIM_ENABLE_QUAD_INPUT_MODE(spim);      /* 4-bit, Input. */
            break;

        case 8UL:
            SPIM_ENABLE_OCTAL_INPUT_MODE(spim);     /* 8-bit, Input. */
            break;

        default:
            break;
    }
}

/**
  * @brief      SPIM Start Transfer And Wait Busy Status.
  * @param      spim
  * @param      u32IsSync   Wait Busy Status
  * @return     SPIM_OK          SPIM write done.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int32_t spim_waitoperation(SPIM_T *spim, uint32_t u32IsSync)
{
    volatile int32_t i32TimeOutCount = SPIM_TIMEOUT;

    SPIM_SET_GO(spim);

    if (u32IsSync)
    {
        while (SPIM_IS_BUSY(spim))
        {
            if (--i32TimeOutCount <= 0)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }
    }

    return SPIM_OK;
}

/**
  * @brief      Write data to SPI slave.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      u32NTx      Number of bytes to transmit.
  * @return     SPIM_OK          SPIM write done.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int32_t spim_write_data(SPIM_T *spim, uint8_t pu8TxBuf[],
                               uint32_t u32NTx, uint32_t u32NBit)
{
    uint32_t buf_idx = 0UL;

    SwitchNBitOutput(spim, u32NBit);

    while (u32NTx)
    {
        uint32_t dataNum = 0UL, dataNum2;

        if (u32NTx >= 16UL)
        {
            dataNum = 4UL;
        }
        else if (u32NTx >= 12UL)
        {
            dataNum = 3UL;
        }
        else if (u32NTx >= 8UL)
        {
            dataNum = 2UL;
        }
        else if (u32NTx >= 4UL)
        {
            dataNum = 1UL;
        }

        dataNum2 = dataNum;

        while (dataNum2)
        {
            uint32_t tmp;

