wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
            memcpy(&tmp, &pu8TxBuf[buf_idx], 4U);
            buf_idx += 4UL;
            u32NTx -= 4UL;

            dataNum2--;
            /*  *((__O uint32_t *) &SPIM->TX0 + dataNum2) = tmp; */
            spim->TX[dataNum2] = tmp;
        }

        if (dataNum)
        {
            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, 32UL);
            SPIM_SET_BURST_DATA(spim, dataNum);

            if (spim_waitoperation(spim, SPIM_OP_ENABLE) != SPIM_OK)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }

        if (u32NTx && (u32NTx < 4UL))
        {
            uint32_t  rnm, tmp;

            rnm = u32NTx;
            memcpy(&tmp, &pu8TxBuf[buf_idx], u32NTx);
            buf_idx += u32NTx;
            u32NTx = 0UL;
            spim->TX[0] = tmp;

            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, (rnm * 8UL));
            SPIM_SET_BURST_DATA(spim, 1UL);

            if (spim_waitoperation(spim, SPIM_OP_ENABLE) != SPIM_OK)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }
    }

    return SPIM_OK;
}

/**
  * @brief      Read data from SPI slave.
  * @param      pu8TxBuf    Receive buffer.
  * @param      u32NRx      Size of receive buffer in bytes.
  * @return     SPIM_OK          SPIM write done.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int32_t spim_read_data(SPIM_T *spim, uint8_t pu8RxBuf[],
                              uint32_t u32NRx, uint32_t u32NBit)
{
    uint32_t  buf_idx = 0UL;

    SwitchNBitInput(spim, u32NBit);

    while (u32NRx)
    {
        uint32_t dataNum = 0UL;     /* number of words */

        if (u32NRx >= 16UL)
        {
            dataNum = 4UL;
        }
        else if (u32NRx >= 12UL)
        {
            dataNum = 3UL;
        }
        else if (u32NRx >= 8UL)
        {
            dataNum = 2UL;
        }
        else if (u32NRx >= 4UL)
        {
            dataNum = 1UL;
        }

        if (dataNum)
        {
            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, 32UL);
            SPIM_SET_BURST_DATA(spim, dataNum);

            if (spim_waitoperation(spim, SPIM_OP_ENABLE) != SPIM_OK)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }

        while (dataNum)
        {
            uint32_t tmp;

            tmp = spim->RX[dataNum - 1UL];
            memcpy(&pu8RxBuf[buf_idx], &tmp, 4U);
            buf_idx += 4UL;
            dataNum --;
            u32NRx -= 4UL;
        }

        if (u32NRx && (u32NRx < 4UL))
        {
            uint32_t tmp;

            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, (u32NRx * 8UL));
            SPIM_SET_BURST_DATA(spim, 1UL);

            if (spim_waitoperation(spim, SPIM_OP_ENABLE) != SPIM_OK)
            {
                return SPIM_ERR_TIMEOUT;
            }

            tmp = spim->RX[0];
            memcpy(&pu8RxBuf[buf_idx], &tmp, u32NRx);
            buf_idx += u32NRx;
            u32NRx = 0UL;
        }
    }

    return SPIM_OK;
}

/**
  * @brief      Issue Read Status Register #1 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @param      u32DcNum    transmit dummy cycle.
  * @return     None.
  */
void SPIM_ReadStatusRegister(SPIM_T *spim, uint8_t dataBuf[],
                             uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR, OPCODE_RDSR};      /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);               /* CS activated. */

    spim_write_data(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_IO_SendDummyCycle(spim, 8);

    spim_read_data(spim, dataBuf, u32NRx, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);              /* CS deactivated. */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);           /* DTR deactivated. */
}

/**
  * @brief      Issue Write Status Register #1 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteStatusRegister(SPIM_T *spim, uint8_t dataBuf[],
                                     uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR, 0x0UL};        /* 1-byte Write Status Register #1 command + 1-byte data. */

    cmdBuf[1] = dataBuf[0];

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                        /* CS activated. */

    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                        /* CS deactivated. */
}

/**
  * @brief      Issue Read Status Register #2 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
 * @param       u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadStatusRegister2(SPIM_T *spim, uint8_t dataBuf[],
                                     uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR2, OPCODE_RDSR2};      /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                /* CS activated. */

    spim_write_data(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_IO_SendDummyCycle(spim, 8);

    spim_read_data(spim, dataBuf, u32NRx, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                /* CS deactivated. */
}

/**
  * @brief      Issue Winbond Write Status Register command. This command write both Status Register-1
  *             and Status Register-2.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteStatusRegister2(SPIM_T *spim, uint8_t dataBuf[],
                                      uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[3] = {OPCODE_WRSR, 0U, 0U};

    cmdBuf[1] = dataBuf[0];
    cmdBuf[2] = dataBuf[1];

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);        /* CS activated. */

    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);        /* CS deactivated. */
}

/**
  * @brief      Issue Read Config Register #3 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t dataBuf[],
                                     uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR3, OPCODE_RDSR3};              /* 1-byte Read Status Register #1 command. */

