wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                        /* CS activated. */

    spim_write_data(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    spim_read_data(spim, dataBuf, u32NRx, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                        /* CS deactivated. */
}

/**
  * @brief      Read Micron MT35X Octal SPI Flash Flag Status Register.
  * @param      spim
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Receive Length.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadMT35XFlagRegister(SPIM_T *spim, uint8_t dataBuf[],
                                       uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {0x70, 0x70};           /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                          /* CS activated. */

    spim_write_data(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    spim_read_data(spim, dataBuf, u32NRx, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                          /* CS deactivated. */
}

/**
  * @brief      Issue Winbond Write Config Register command. This command write both Status Register-1
  *             and Status Register-2.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_WriteConfigRegister(SPIM_T *spim, uint8_t u8CMD, uint32_t u32Addr,
                              uint8_t u8Data, uint32_t u32NBit)
{
    uint8_t cmdBuf[4] = {0x0U};
    uint32_t u32BufIdx = 0;

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode. */

    SPIM_SetWriteEnable(spim, 1, u32NBit);

    SPIM_SET_SS_EN(spim, 1);                    /* CS activated.    */

    cmdBuf[0] = u8CMD;

    spim_write_data(spim, cmdBuf, 1UL, u32NBit);

    //cmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 24);
    cmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 16);
    cmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 8);
    cmdBuf[u32BufIdx++] = (uint8_t) u32Addr;
    spim_write_data(spim, cmdBuf, u32BufIdx, u32NBit);

    cmdBuf[0] = u8Data;
    spim_write_data(spim, cmdBuf, 1UL, u32NBit);

    SPIM_SET_SS_EN(spim, 0);                    /* CS deactivated.  */

    spim_wait_writedone(spim, 1UL);
}

/**
  * @brief      Issue Read Status Register #3 command.
  * @param      pu8DataBuf  Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadConfigRegister(SPIM_T *spim, uint8_t u8RdCMD, uint32_t u32Addr,
                             uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[8] = {0};
    uint32_t buf_idx = 0;

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);         /* Switch back to Normal mode.  */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);               /* CS activated. */

    cmdBuf[0] = u8RdCMD;

    spim_write_data(spim, cmdBuf, 1UL, u32NBit);        /* Write out command. */

    buf_idx = 0;
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
    cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    buf_idx++;//for dummy cycle
    spim_write_data(spim, cmdBuf, buf_idx, u32NBit);    /* Write out Address. */

    spim_read_data(spim, pu8DataBuf, u32NRx, u32NBit);  /* Read back data. */

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);              /* CS deactivated. */
}

/**
  * @brief      Issue Read Security Register command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadSecurityRegister(SPIM_T *spim, uint8_t dataBuf[],
                                      uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSCUR, OPCODE_RDSCUR};     /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                /* CS activated. */

    spim_write_data(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    spim_read_data(spim, dataBuf, u32NRx, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                /* CS deactivated. */
}

/**
 * @brief Set SPI flash exit continue read mode.
 *
 * @param spim
 */
int32_t SPIM_SetContReadDisable(SPIM_T *spim)
{
    SPIM_SetQuadEnable(spim, SPIM_OP_ENABLE, 1);

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                        /* CS activated. */

    spim->TX[0] = 0xFFFFFFFF;

    SwitchNBitOutput(spim, 4);                          /* Quad output mode */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 1UL);

    if (spim_waitoperation(spim, 1) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                        /* CS deactivated. */

    SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, 1);

    spim_clr_contreadphase(spim, SPIM_CTL0_OPMODE_DIRECTMAP);

    return SPIM_OK;
}

/**
  * @brief      Check if Erase/Write is done.
  * @return     0: Not done. 1: Done.
  */
static int spim_is_writedone(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t status[2];
    SPIM_ReadStatusRegister(spim, status, sizeof(status), u32NBit);
    return !(status[0] & SR_WIP);
}

/**
  * @brief      Wait until Erase/Write done.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     SPIM_OK          SPIM write done.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int32_t spim_wait_writedone(SPIM_T *spim, uint32_t u32NBit)
{
    uint32_t count;
    int32_t ret = SPIM_ERR_TIMEOUT;

    for (count = 0UL; count < SystemCoreClock / 1000UL; count++)
    {
        if (spim_is_writedone(spim, u32NBit))
        {
            ret = SPIM_OK;
            break;
        }
    }

    if (ret != 0)
    {
        SPIM_DBGMSG("spim_wait_writedone time-out!!\n");
    }

    return ret;
}

/**
  * @brief      Issue Write Enable/disable command.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_SetWriteEnable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[2] = {0U};            /* 1-byte Write Enable command. */
    uint8_t u8CmdSize = 1;

    cmdBuf[0] = isEn ? OPCODE_WREN : OPCODE_WRDI;

