wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
    if (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE)
    {
        cmdBuf[1] = isEn ? OPCODE_WREN : OPCODE_WRDI;
        u8CmdSize = 2;
    }

    SPIM_SET_SS_EN(spim, 1);            /* CS activated. */

    spim_write_data(spim, cmdBuf, u8CmdSize, u32NBit);

    SPIM_SET_SS_EN(spim, 0);            /* CS deactivated. */
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Get SPIM serial clock.
  * @return     SPI serial clock.
  * @details    This function calculates the serial clock of SPI in Hz.
  */
uint32_t SPIM_GetSClkFreq(SPIM_T *spim)
{
    uint32_t clkDiv = SPIM_GET_CLOCK_DIVIDER(spim);

    return clkDiv ? SystemCoreClock / (clkDiv * 2U) : SystemCoreClock;
}

/**
  * @brief      Initialize SPIM flash.
  * @param      clrWP           Clear Write Protect or not.
  * @return     SPIM_OK         Success.
  *             SPIM_ERR_FAIL   Unrecognized manufacture ID or failed on reading manufacture ID.
  */
int32_t SPIM_InitFlash(SPIM_T *spim, int clrWP)
{
    uint8_t   idBuf[3];
    uint8_t   cmdBuf[1];
    uint32_t  i = 0;
    int32_t   ret = SPIM_ERR_FAIL;

    SPIM_SET_FLASH_MODE(spim); /* Enable SPI Flash Mode */

    SPIM_SET_SS_ACTLVL(spim, 0);

    /*
     * Because not sure in SPI or QPI mode, do QPI reset and then SPI reset.
     */
    /* QPI Reset Enable */
    cmdBuf[0] = OPCODE_RSTEN;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* QPI Reset */
    cmdBuf[0] = OPCODE_RST;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* SPI ResetEnable */
    cmdBuf[0] = OPCODE_RSTEN;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* SPI Reset */
    cmdBuf[0] = OPCODE_RST;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (clrWP)
    {
        uint8_t dataBuf[] = {0x00U};

        SPIM_SetWriteEnable(spim, 1, 1UL);          /* Clear Block Protect. */
        SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), 1U);
        spim_wait_writedone(spim, 1UL);
    }

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), 1UL, 0);

    /* printf("ID: 0x%x, 0x%x, px%x\n", idBuf[0], idBuf[1], idBuf[2]); */

    for (i = 0UL; i < sizeof(g_Supported_List) / sizeof(g_Supported_List[0]); i++)
    {
        if (idBuf[0] == g_Supported_List[i])
        {
            ret = SPIM_OK;
        }
    }

    if (ret != 0)
    {
        SPIM_DBGMSG("Flash initialize failed!! 0x%x\n", idBuf[0]);
    }

    return ret;
}

/**
 * @brief   Issue JEDEC ID command.
 *
 * @param spim
 * @param pu8IdBuf          ID buffer.
 * @param u32NRx            Size of ID buffer.
 * @param u32NBit           N-bit transmit/receive.
 * @param u32DummyCycle     Dummy cycle counter
 * @return                  none
 */
void SPIM_ReadJedecId(SPIM_T *spim, uint8_t *pu8IdBuf, uint32_t u32NRx,
                      uint32_t u32NBit, uint32_t u32DcNum)
{
    uint8_t cmdBuf[2] = {OPCODE_RDID, OPCODE_RDID};   /* 2-byte JEDEC ID command. */
    uint8_t u8CmdSize = 1;

    SPIM_SET_SS_EN(spim, 1);                /* CS activated. */

    if (SPIM_GET_DTR_MODE(spim) == 1)
    {
        u8CmdSize = 2;
    }

    spim_write_data(spim, cmdBuf, u8CmdSize, u32NBit);

    SPIM_IO_SendDummyCycle(spim, u32DcNum);

    spim_read_data(spim, pu8IdBuf, u32NRx, u32NBit);

    SPIM_SET_SS_EN(spim, 0);                /* CS deactivated. */
}

/** @cond HIDDEN_SYMBOLS */

static void spim_enable_spansion_quad_mode(SPIM_T *spim, int isEn)
{
    uint8_t cmdBuf[3];
    uint8_t dataBuf[1], status1;

    cmdBuf[0] = 0x5U;                            /* Read Status Register-1 */

    SPIM_SET_SS_EN(spim, 1);

    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);

    spim_read_data(spim, dataBuf, sizeof(dataBuf), 1UL);

    SPIM_SET_SS_EN(spim, 0);
    /* SPIM_DBGMSG("SR1 = 0x%x\n", dataBuf[0]); */

    status1 = dataBuf[0];

    cmdBuf[0] = 0x35U;                           /* Read Configuration Register-1 */

    SPIM_SET_SS_EN(spim, 1);

    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);

    spim_read_data(spim, dataBuf, sizeof(dataBuf), 1UL);

    SPIM_SET_SS_EN(spim, 0);
    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */

    SPIM_SetWriteEnable(spim, 1, 1UL);

    cmdBuf[0] =  0x1U;                           /* Write register */
    cmdBuf[1] =  status1;

    if (isEn)
    {
        cmdBuf[2] = dataBuf[0] | 0x2U;           /* set QUAD */
    }
    else
    {
        cmdBuf[2] = dataBuf[0] & ~0x2U;          /* clear QUAD */
    }

    SPIM_SET_SS_EN(spim, 1);

    spim_write_data(spim, cmdBuf, 3UL, 1UL);

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetWriteEnable(spim, 0, 1UL);


    cmdBuf[0] = 0x35U;                           /* Read Configuration Register-1 */

    SPIM_SET_SS_EN(spim, 1);

    spim_write_data(spim, cmdBuf, sizeof(cmdBuf), 1UL);

    spim_read_data(spim, dataBuf, sizeof(dataBuf), 1UL);

    SPIM_SET_SS_EN(spim, 0);

    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */
    N_delay(10000);
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Set Wrap Around Enable/disable.
  * @param      isEn    Wrap Mode.
 *                      - \ref SPIM_OP_ENABLE  : Enable
 *                      - \ref SPIM_OP_DISABLE : disable
  * @param      u32NBit N-bit transmit/receive.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
int32_t SPIM_SetWrapAroundEnable(SPIM_T *spim, int isEn)
{
    uint32_t u32CmdBuf[2] = {0x00000000, 0x11011101};

    SPIM_SetQuadEnable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);

    spim->TX[0] = (u32CmdBuf[0] | (1 << 28));

    if (isEn == 1)
    {
        spim->TX[0] = ((u32CmdBuf[0] & ~(1 << 28)) | (1 << 29));
    }

    spim->TX[1] = 0x11011101;

    SwitchNBitOutput(spim, 4UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 2);

    if (spim_waitoperation(spim, 1) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

    return SPIM_OK;
}

/**
  * @brief      Set Quad Enable/disable.
  * @param      isEn    Quad Mode.
 *                      - \ref SPIM_OP_ENABLE
 *                      - \ref SPIM_OP_DISABLE
  * @param      u32NBit N-bit transmit/receive.
  * @return     None.
  */
void SPIM_SetQuadEnable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t  idBuf[3];
    uint8_t  dataBuf[2];

