wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit, 0);

    SPIM_DBGMSG("SPIM_SetQuadEnable - Flash ID is 0x%x\n", idBuf[0]);

    switch (idBuf[0])
    {
        case MFGID_WINBOND:                      /* Winbond SPI flash  */
            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

            if (isEn)
            {
                dataBuf[1] |= SR2_QE;
            }
            else
            {
                dataBuf[1] &= ~SR2_QE;
            }

            SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);   /* Write Enable.    */
            SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
            spim_wait_writedone(spim, u32NBit);

            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
            break;

        case MFGID_MXIC:                         /* MXIC SPI flash.  */
        case MFGID_EON:
        case MFGID_ISSI:                               /* ISSI SPI flash.  */
            SPIM_SetWriteEnable(spim, 1, u32NBit);   /* Write Enable.    */
            dataBuf[0] = isEn ? SR_QE : 0U;
            SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            spim_wait_writedone(spim, u32NBit);
            break;

        case MFGID_SPANSION:
            spim_enable_spansion_quad_mode(spim, isEn);
            break;

        default:
            break;
    }
}

static void SPIM_SPANSION_4Bytes_Enable(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[2];
    uint8_t dataBuf[1];

    cmdBuf[0] = OPCODE_BRRD;

    SPIM_SET_SS_EN(spim, 1);                     /* CS activated. */

    spim_write_data(spim, cmdBuf, 1UL, u32NBit);

    spim_read_data(spim, dataBuf, 1UL, 1UL);

    SPIM_SET_SS_EN(spim, 0);                     /* CS deactivated. */

    SPIM_DBGMSG("Bank Address register= 0x%x\n", dataBuf[0]);

    cmdBuf[0] =  OPCODE_BRWR;

    if (isEn)
    {
        cmdBuf[1] = dataBuf[0] | 0x80U;          /* set EXTADD */
    }
    else
    {
        cmdBuf[1] = dataBuf[0] & ~0x80U;         /* clear EXTADD */
    }

    SPIM_SET_SS_EN(spim, 1);                     /* CS activated. */

    spim_write_data(spim, cmdBuf, 2UL, 1UL);

    SPIM_SET_SS_EN(spim, 0);                     /* CS deactivated. */
}

/** @cond HIDDEN_SYMBOLS */

/**
  * @brief      Query 4-byte address mode enabled or not.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0: 4-byte address mode disabled. 1: 4-byte address mode enabled.
  */
int32_t SPIM_Is4ByteModeEnable(SPIM_T *spim, uint32_t u32NBit)
{
    int32_t isEn = 0;
    int32_t isSupt = 0;
    uint8_t idBuf[3];
    uint8_t dataBuf[1];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit, 0);

    /* Based on Flash size, check if 4-byte address mode is supported.  */
    switch (idBuf[0])
    {
        case MFGID_WINBOND:
        case MFGID_MXIC:
        case MFGID_EON:
            isSupt = (idBuf[2] < 0x19U) ? 0L : 1L;
            break;

        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        case MFGID_MICRON:
            SPIM_ReadMT35XFlagRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
            break;

        default:
            break;
    }

    if (isSupt != 0)
    {
        if (idBuf[0] == MFGID_WINBOND)
        {
            /* Winbond SPI flash. */
            SPIM_ReadStatusRegister3(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
        }
        else if ((idBuf[0] == MFGID_MXIC) || (idBuf[0] == MFGID_EON))
        {
            /* MXIC/EON SPI flash. */
            SPIM_ReadSecurityRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SCUR_4BYTE);
        }
    }

    return isEn;
}

/** @endcond HIDDEN_SYMBOLS  */

/**
  * @brief      Enter/Exit 4-byte address mode.
  * @param      isEn        Enable/disable.
  *                         - \ref SPIM_OP_ENABLE
  *                         - \ref SPIM_OP_DISABLE
  * @param      u32NBit     N-bit transmit/receive.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_FAIL    SPIM operation Fail.
  */
int32_t SPIM_Enable_4Bytes_Mode(SPIM_T *spim, int isEn, uint32_t u32NBit)
{
    int32_t isSupt = 0L, ret = SPIM_ERR_FAIL;
    uint8_t idBuf[3];                        /* 1-byte Enter/Exit 4-Byte Mode command. */

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit, 0);

    /* Based on Flash size, check if 4-byte address mode is supported. */
    switch (idBuf[0])
    {
        case MFGID_WINBOND:
            isSupt = (idBuf[2] < 0x16U) ? 0L : 1L;
            break;

        case MFGID_MXIC:
        case MFGID_EON:
            isSupt = (idBuf[2] < 0x19U) ? 0L : 1L;
            break;

        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        case MFGID_SPANSION:
            SPIM_SPANSION_4Bytes_Enable(spim, isEn, u32NBit);
            isSupt = 1L;
            ret = SPIM_OK;
            break;

        case MFGID_MICRON:
            SPIM_SetWriteEnable(spim, 1, u32NBit);
            isSupt = 1;
            break;

        default:
            break;
    }

    if ((isSupt) && (idBuf[0] != MFGID_SPANSION))
    {
        uint8_t cmdBuf[2];
        uint8_t u8CmdSize = 1;

        cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;

        if (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE)
        {
            cmdBuf[1] = isEn ? OPCODE_EN4B : OPCODE_EX4B;
            u8CmdSize = 2;
        }

        SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */

        spim_write_data(spim, cmdBuf, u8CmdSize, u32NBit);

        SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

