wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
        /*
         * FIXME: Per test, 4BYTE Indicator bit doesn't set after EN4B, which
         * doesn't match spec(MX25L25635E), so skip the check below.
         */
        ret = SPIM_OK;

        if (idBuf[0] != MFGID_MXIC)
        {
            volatile int32_t i32TimeOutCount = 0;

            /*
             *  About over 100 instrucsions executed, just want to give
             *  a time-out about 1 seconds to avoid infinite loop
             */
            i32TimeOutCount = (SystemCoreClock) / 100;

            if (isEn)
            {
                while ((i32TimeOutCount-- > 0) && !SPIM_Is4ByteModeEnable(spim, u32NBit)) { }
            }
            else
            {
                while ((i32TimeOutCount-- > 0) && SPIM_Is4ByteModeEnable(spim, u32NBit)) { }
            }

            if (i32TimeOutCount <= 0)
                ret = SPIM_ERR_FAIL;
        }
    }

    return ret;
}

void SPIM_WinbondUnlock(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t idBuf[3];
    uint8_t dataBuf[4];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit, 0);

    if ((idBuf[0] != MFGID_WINBOND) || (idBuf[1] != 0x40) || (idBuf[2] != 0x16))
    {
        SPIM_DBGMSG("SPIM_WinbondUnlock - Not W25Q32, do nothing.\n");
        return;
    }

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
    dataBuf[1] &= ~0x40;    /* clear Status Register-1 SEC bit */

    SPIM_SetWriteEnable(spim, 1, u32NBit);   /* Write Enable.    */
    SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
    spim_wait_writedone(spim, u32NBit);

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register (after unlock): 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
}

/**
  * @brief      Erase whole chip.
  * @param      u32NBit     N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_ChipErase(SPIM_T *spim, uint32_t u32NBit, int isSync)
{
    uint8_t cmdBuf[] = {OPCODE_CHIP_ERASE, OPCODE_CHIP_ERASE};      /* 1-byte Chip Erase command. */

    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);             /* Write Enable.    */

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                           /* CS activated.    */

    spim_write_data(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                          /* CS deactivated.  */

    if (isSync)
    {
        spim_wait_writedone(spim, u32NBit);
    }
}

/**
  * @brief      Erase one block.
  * @param      u32Addr         Block to erase which contains the u32Addr.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u8ErsCmd        Erase command.
  *                             - ref OPCODE_SE_4K
  *                             - ref OPCODE_BE_32K
  *                             - ref OPCODE_BE_64K
  * @param      u32NBit         N-bit transmit/receive.
  * @param      isSync          Block or not.
  * @return     None.
  */
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                     uint8_t u8ErsCmd, uint32_t u32NBit, int isSync)
{
    uint8_t  cmdBuf[16];
    uint32_t  buf_idx = 0UL;

    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);           /* Write Enable.    */

    cmdBuf[buf_idx++] = u8ErsCmd;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                      /* CS activated.    */

    spim_write_data(spim, cmdBuf, buf_idx, u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                      /* CS deactivated.  */

    if (isSync)
    {
        spim_wait_writedone(spim, u32NBit);
    }
}

/** @cond HIDDEN_SYMBOLS */
/**
 * @brief Swich DMA/DMM Phase Setting Register
 * @param      spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @return     PHDMAW/PHDMAR/PHDMM Register Address
 */
static void *SPIM_SwitchPhaseRegister(SPIM_T *spim, uint32_t u32OPMode)
{
    switch (u32OPMode)
    {
        case SPIM_CTL0_OPMODE_PAGEWRITE:
            return (uint32_t *)&spim->PHDMAW;
            break;

        case SPIM_CTL0_OPMODE_PAGEREAD:
            return (uint32_t *)&spim->PHDMAR;
            break;

        case SPIM_CTL0_OPMODE_DIRECTMAP:
            return (uint32_t *)&spim->PHDMM;
            break;

        default:
            break;
    }

    return NULL;
}

/**
  * @brief      Write data in the same page by I/O mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      isSync      Block or not.
  * @return     None.
  */
static void SPIM_WriteInPageDataByIO(SPIM_T *spim, uint32_t u32Addr,
                                     int is4ByteAddr, uint32_t u32NTx,
                                     uint8_t pu8TxBuf[], uint8_t wrCmd,
                                     uint32_t u32NBitCmd, uint32_t u32NBitAddr,
                                     uint32_t u32NBitDat, int isSync)
{
    uint8_t cmdBuf[16];
    uint32_t buf_idx;
    uint32_t u32TxSize = 1UL;

    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBitCmd);  /* Write Enable. */

