wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                   /* CS activated. */
    cmdBuf[0] = wrCmd;

    if (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE)
    {
        cmdBuf[1] = wrCmd;
        u32TxSize = 2UL;
    }

    spim_write_data(spim, cmdBuf, u32TxSize, u32NBitCmd);   /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    spim_write_data(spim, cmdBuf, buf_idx, u32NBitAddr);    /* Write out u32Address. */

    spim_write_data(spim, pu8TxBuf, u32NTx, u32NBitDat);    /* Write out data.  */

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                  /* CS deactivated.  */

    if (isSync)
    {
        spim_wait_writedone(spim, u32NBitCmd);
    }
}

/**
  * @brief      Write data in the same page by Page Write mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      isSync      Block or not.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int32_t SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr,
                                               int is4ByteAddr, uint32_t u32NTx,
                                               uint8_t pu8TxBuf[], uint32_t wrCmd, int isSync)
{
    SPIM_CLEAR_MODE_DATA(spim);                         /* Disable continue read */
    SPIM_DISABLE_DMM_BWEN(spim);                        /* Disable burst wrap */

    SPIM_SetWriteEnable(spim,
                        SPIM_OP_ENABLE,
                        SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));                  /* Write Enable. */

    SPIM_SET_4BYTE_ADDR(spim, is4ByteAddr);             /* Enable/disable 4-Byte Address. */

    SPIM_SET_SPIM_MODE(spim, wrCmd);                    /* SPIM mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);  /* Switch to Page Write mode. */

    spim->SRAMADDR = (uint32_t)pu8TxBuf;                /* SRAM u32Address. */
    spim->DMACNT = u32NTx;                              /* Transfer length. */
    spim->FADDR = u32Addr;                              /* Flash u32Address.*/

    if (spim_waitoperation(spim, isSync) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    spim_wait_writedone(spim, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief Convert I/O phase bit mode size.
 *
 * @param u32Phase
 *          - \ref PHASE_NORMAL_MODE : 1 Bit Mode
 *          - \ref PHASE_DUAL_MODE   : 2 Bit Mode
 *          - \ref PHASE_QUAD_MODE   : 4 Bit Mode
 *          - \ref PHASE_OCTAL_MODE  : 8 Bit Mode
 * @return uint32_t Phase Size
 */
uint32_t SPIM_PhaseModeToNBit(uint32_t u32Phase)
{
    uint32_t u32PhaseSize = 0;

    switch (u32Phase)
    {
        case PHASE_DUAL_MODE:
            u32PhaseSize = 2;
            break;

        case PHASE_QUAD_MODE:
            u32PhaseSize = 4;
            break;

        case PHASE_OCTAL_MODE:
            u32PhaseSize = 8;
            break;

        default:
        case PHASE_NORMAL_MODE:
            u32PhaseSize = 1;
            break;
    }

    return u32PhaseSize;
}

/**
 * @brief Set DMA/DMM Command Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 */
static int32_t spim_set_cmdphase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Command phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_CMD_Pos);

    *pu32PhaseReg |= (u32Width << SPIM_PHDMAW_DW_CMD_Pos);
    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_CMD_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAW_BM_CMD_Pos);

    return SPIM_OK;
}

/**
 * @brief Set DMA/DMM Address Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
static int32_t spim_set_addrphase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Address phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_ADDR_Pos);

    *pu32PhaseReg |= (u32Width << SPIM_PHDMAW_DW_ADDR_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAW_BM_ADDR_Pos);
    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_ADDR_Pos);

    return SPIM_OK;
}

