wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
static void spim_clr_contreadphase(SPIM_T *spim, uint32_t u32OPMode)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_READMODE_Pos);
}

/**
 * @brief Set DMA/DMM Continue Read Mode Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
static int32_t spim_set_contreadphase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32ContEn, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Read Mode phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_READMODE_Pos);

    *pu32PhaseReg |= (u32Width << SPIM_PHDMAR_DW_MODE_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAR_BM_MODE_Pos);
    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_MODE_Pos);

    if ((u32ContEn == PHASE_ENABLE_CONT_READ) &&
            (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP))
    {
        SPIM_ENABLE_DMM_CREN(spim);

        /* Enable Contiue Read Mode */
        SPIM_SET_MODE_DATA(spim, CMD_CONTINUE_READ_MODE);
    }
    else
    {
        SPIM_CLEAR_MODE_DATA(spim);
    }

    return SPIM_OK;
}

/**
 * @brief Set DMA/DMM Data Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32ByteOrder Set Received Data Byte Order of Received Data Phase for Octal SPI Flash
 *                  - \ref PHASE_ORDER_MODE0 : Reveice Data Format Ref. {byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7}
 *                  - \ref PHASE_ORDER_MODE1 : Reveice Data Format Ref. {byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0}
 *                  - \ref PHASE_ORDER_MODE2 : Reveice Data Format Ref. {byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6}
 *                  - \ref PHASE_ORDER_MODE3 : Reveice Data Format Ref. {byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1}
 * @param u32DTREn Set Enable/Disable DTR(Double Transfer Rate) Mode
 *                  - \ref SPIM_OP_ENABLE
 *                  - \ref SPIM_OP_DISABLE
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
static int32_t spim_set_dataphase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit,
                                  uint32_t u32ByteOrder, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Data phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_DATA_Pos);

    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_DATA_Pos);
    *pu32PhaseReg &= ~(SPIM_PHDMAR_RDQS_DATA_Msk);
    *pu32PhaseReg |= (u32ByteOrder << SPIM_PHDMAW_PBO_DATA_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAW_BM_DATA_Pos);

    return SPIM_OK;
}

/**
 * @brief Set DMA read/DMM mode read DQS mode enable bit for data phase
 *
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 * @param u32RdDQS  Enable/Disable Read DQS
 *                  - \ref SPIM_OP_ENABLE
 *                  - \ref SPIM_OP_DISABLE
 */
void SPIM_DMADMM_SetRWDQS(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32RdDQS)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    *pu32PhaseReg |= (u32RdDQS << SPIM_PHDMAR_RDQS_DATA_Pos);
}

/**
 * @brief Init DMA/DMM SPI Flash Read/Wirte Command Phase
 * @param spim
 * @param psPhaseTable  Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32OPMode     SPI Function Operation Mode
 *                      - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                      - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                      - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 */
void SPIM_DMADMM_InitPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable, uint32_t u32OPMode)
{
    uint32_t u32Is4ByteAddr = 0;
    uint32_t u32QuadMode = 0;
    uint32_t u32CmdBit = SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase);

    /* Disable SPI Flash Quad Mode */
    SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, u32CmdBit);

    /* Clear SPIM Read Mode (Continue Read) */
    SPIM_CLEAR_MODE_DATA(spim);

    u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                    (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, u32CmdBit);

