wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
    SPIM_SET_DTR_MODE(spim, u32DTREn);          /* DTR Activated. */

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        /* Write Enable. */
        SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, SPIM_PhaseModeToNBit(u32CMDPhase));
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);       /* CS activated. */

    u8CmdBuf[0] = (u32OpCMD & 0xFF);

    if (u32DTREn == SPIM_OP_ENABLE)
    {
        u8CmdBuf[1] = (u32OpCMD & 0xFF);
        u8CmdSize = 2UL;
    }

    spim_write_data(spim, u8CmdBuf, u8CmdSize, SPIM_PhaseModeToNBit(u32CMDPhase));      /* Write out command. */

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);   /* DTR Deactivated. */
}

static void SPIM_WriteInPageDataByPhaseIO(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                                          uint32_t u32Addr, int is4ByteAddr,
                                          uint8_t *pu8TxBuf, uint32_t u32RdSize)
{
    SPIM_IO_SendCMDPhase(spim,
                         SPIM_IO_WRITE_PHASE,
                         psPhaseTable->u32CMDCode,
                         psPhaseTable->u32CMDPhase,
                         psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddrPhase(spim,
                          is4ByteAddr,
                          u32Addr,
                          psPhaseTable->u32AddrPhase,
                          psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    SPIM_IO_SendDummyCycle(spim, psPhaseTable->u32DcNum);

    SPIM_IO_SendDataPhase(spim,
                          SPIM_IO_WRITE_PHASE,
                          pu8TxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR);
}

void SPIM_IO_WritePhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                        uint32_t u32Addr, uint8_t *pu8TxBuf, uint32_t u32WrSize)
{
    uint32_t u32PageOffset;
    uint32_t u32BufIdx = 0UL;
    uint32_t u32Is4ByteAddr = 0;
    uint32_t u32QuadMode = 0;

    u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                    (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    if (u32QuadMode == SPIM_OP_ENABLE)
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }

    u32PageOffset = u32Addr % 256UL;

    if ((u32PageOffset + u32WrSize) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], u32WrSize);
    }
    else
    {
        uint32_t toWr = 256UL - u32PageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], toWr);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32WrSize -= toWr;
        u32BufIdx += toWr;

        while (u32WrSize)
        {
            toWr = 256UL;

            if (toWr > u32WrSize)
            {
                toWr = u32WrSize;
            }

            SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], toWr);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32WrSize -= toWr;
            u32BufIdx += toWr;
        }
    }

    if (u32QuadMode == SPIM_OP_ENABLE)
    {
        SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32RdSize   Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @param      u32DTREn    DTR mode
  *                         - \ref SPIM_OP_ENABLE
  *                         - \ref SPIM_OP_DISABLE
  * @return     None.
  */

/**
 * @brief
 *
 * @param spim          Read data from SPI Flash by use phase table (I/O mode).
 * @param psPhaseTable  Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32Addr       Read start address
 * @param pu8RxBuf      Data buffer
 * @param u32RdSize     Read data size
 */
void SPIM_IO_ReadPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                       uint32_t u32Addr, uint8_t *pu8RxBuf, uint32_t u32RdSize)
{
    uint32_t u32Is4ByteAddr = 0;

    u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    SPIM_SetQuadEnable(spim,
                       (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                         (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE),
                       SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));

    SPIM_IO_SendCMDPhase(spim,
                         SPIM_IO_READ_PHASE,
                         psPhaseTable->u32CMDCode,
                         psPhaseTable->u32CMDPhase,
                         psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddrPhase(spim,
                          u32Is4ByteAddr,
                          u32Addr,
                          psPhaseTable->u32AddrPhase,
                          psPhaseTable->u32AddrDTR);

