wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
    /* Write out dummy bytes. */
    SPIM_IO_SendDummyCycle(spim, psPhaseTable->u32DcNum);

    SPIM_IO_SendDataPhase(spim,
                          SPIM_IO_READ_PHASE,
                          pu8RxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR);

    if ((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
            (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE))
    {
        SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }
}

/**
  * @brief      Write data to SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @return     None.
  */
void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                   uint32_t u32NTx, uint8_t *pu8TxBuf, uint8_t wrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat)
{
    uint32_t  pageOffset;
    uint32_t  buf_idx = 0UL;

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByIO(spim, u32Addr, is4ByteAddr, u32NTx, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, SPIM_OP_ENABLE);
    }
    else
    {
        uint32_t toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByIO(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, SPIM_OP_ENABLE);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByIO(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                     wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, SPIM_OP_ENABLE);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @return     None.
  */
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint32_t u32NRx, uint8_t *pu8RxBuf, uint8_t rdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, int u32NDummy)
{
    uint8_t cmdBuf[16];
    uint32_t buf_idx = 1UL;

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);                   /* CS activated.    */

    cmdBuf[0] = rdCmd;

    if (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE)
    {
        cmdBuf[1] = rdCmd;
        buf_idx = 2UL;
    }

    spim_write_data(spim, cmdBuf, buf_idx, u32NBitCmd);     /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    /* Add a byte for the address phase for dual or quad mode for read mode */
    if ((u32NBitAddr == 2) ||
            (u32NBitAddr == 4))
    {
        buf_idx++;
    }

    spim_write_data(spim, cmdBuf, buf_idx, u32NBitAddr);    /* Write out u32Address. */

    /* Same bit mode as above. */
    SPIM_IO_SendDummyCycle(spim, (u32NDummy * 8));          /* Write out dummy bytes. */

    spim_read_data(spim, pu8RxBuf, u32NRx, u32NBitDat);     /* Read back data.  */

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);                  /* CS deactivated.  */
}

/**
  * @brief      Write data to SPI Flash by Page Write mode.
  * @param      u32Addr     Start address to write.
  * @param      is4ByteAddr 4-byte address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @return     None.
  *
  * @note       Before calling this API, must first call SPIM_DMADMM_InitPhase to set PHDMAW.
  */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                    uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t wrCmd)
{
    uint32_t pageOffset;

    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMAW_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMAW_CMD_DTR(spim) == SPIM_OP_ENABLE))
    {
        SPIM_SET_DTR_MODE(spim, SPIM_OP_ENABLE);          /* DTR Activated. */
        wrCmd = ((wrCmd << 8) | wrCmd);
    }

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)
    {
        /* Do all the bytes fit onto one page ? */
        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, u32NTx,
                                        pu8TxBuf, wrCmd, SPIM_OP_ENABLE);
    }
    else
    {
        uint32_t buf_idx = 0UL;
        uint32_t toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr,
                                        &pu8TxBuf[buf_idx], wrCmd, SPIM_OP_ENABLE);

