wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/spim.c
        u32Addr += toWr;                         /* Advance indicator. */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr,
                                            &pu8TxBuf[buf_idx], wrCmd, SPIM_OP_ENABLE);

            u32Addr += toWr;                 /* Advance indicator. */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }

    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);          /* DTR Activated. */
}

/**
  * @brief      Read data from SPI Flash by Page Read mode.
  * @param      u32Addr     Start address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      u32RdCmd    Read command.
  * @param      isSync      Block or not.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  *             if waiting SPIM time-out.
  * @note       Before calling this API, must first call SPIM_DMADMM_InitPhase to set PHDMAR.
  */
int32_t SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                      uint32_t u32NRx, uint8_t *pu8RxBuf, uint32_t u32RdCmd, int isSync)
{
    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMAR_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMAR_CMD_DTR(spim) == 1))
    {
        u32RdCmd = ((u32RdCmd << 8) | u32RdCmd);
    }

    SPIM_SET_4BYTE_ADDR(spim, is4ByteAddr);             /* Enable/disable 4-Byte Address. */

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);   /* Switch to Page Read mode. */

    SPIM_SET_SPIM_MODE(spim, u32RdCmd);                 /* SPIM mode. */

    spim->SRAMADDR = (uint32_t) pu8RxBuf;               /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                              /* Transfer length. */
    spim->FADDR = u32Addr;                              /* Flash u32Address. */

    if (spim_waitoperation(spim, isSync) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Enter Direct Map mode.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u32RdCmd        Read command.
  * @param      u32IdleIntvl    Idle interval.
  * @return     None.
  * @note       Before calling this API, must first call SPIM_DMADMM_InitPhase to set PHDMM.
  */
void SPIM_EnterDirectMapMode(SPIM_T *spim, int is4ByteAddr,
                             uint32_t u32RdCmd, uint32_t u32IdleIntvl)
{
    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMM_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMM_CMD_DTR(spim) == 1))
    {
        u32RdCmd = ((u32RdCmd << 8) | u32RdCmd);
    }

    SPIM_SET_4BYTE_ADDR(spim, is4ByteAddr);              /* Enable/disable 4-byte u32Address. */
    SPIM_SET_SPIM_MODE(spim, u32RdCmd);                  /* SPIM mode. */
    SPIM_SET_IDL_INTVL(spim, u32IdleIntvl);              /* Idle interval. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);   /* Switch to Direct Map mode. */
}

/**
  * @brief      Exit Direct Map mode.
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
void SPIM_ExitDirectMapMode(SPIM_T *spim)
{
    if (SPIM_GET_DMM_BWEN(spim) == SPIM_OP_ENABLE)
    {
        SPIM_SetWrapAroundEnable(spim, 0);
    }

    if (SPIM_GET_MODE_DATA(spim) == CMD_CONTINUE_READ_MODE)
    {
        SPIM_SetContReadDisable(spim);
    }
}

/**
  * @brief      SPIM used to delay the read data strobe (DQS/RWDS) from Octal SPI Flash and Hyper bus device
  * @param      spim
  * @param      u32ClkOnNum Clock Cycle Number between DLL OLDO Enable and DLL Clock Divider Enable
  * @param      u32TrimNum  Clock Cycle Number between DLL Output Valid and DLL Auto Trim Enable
  * @param      u32LKNum    Clock Cycle Number between DLL Clock Divider Enable and DLL Lock
  * @param      u32OVNum    Clock Cycle Number between DLL Lock and DLL Output Valid
  * @param      u32DelayNum DLL Delay Step Number
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  * @note       First fix DIVIDER to set the frequency of SPIM output bus clock.
  * @note       DLL default setting support
  *             1. Micron MT35XU02GCBA Octal SPI Flash.
  *             2. Winbond W958D8NBYA HyperRAM.
  *             3. Infineon S26KLxxS/S26KSxxS HyperFlash.
  *             Other device users must refer to the device specification set
  *             SPIM_SET_DLLCLKON_NUM()
  *             SPIM_SET_DLLTRIM_NUM()
  *             SPIM_SET_DLLLOCK_VALID()
  *             SPIM_SET_DLLOV_NUM()
  */
int32_t SPIM_SetDLLDelayNum(SPIM_T *spim, uint32_t u32DelayNum)
{
    int i32Timeout = SPIM_TIMEOUT;

    /* SPIM starts to send DLL reference clock to DLL circuit
       that the frequency is the same as the SPIM output bus clock. */
    SPIM_ENABLE_DLLOLDO(spim, 1);

    /* User asserts this control register to 0x1,
       the DLL circuit begins searching for lock with DLL reference clock. */
    SPIM_ENABLE_DLLOVRST(spim, 1);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_GET_DLLCLKON(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLLOCK to 0x1,
       and the value 0x1 indicates that DLL circuit is in lock state */
    while (SPIM_GET_DLLLOCK(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLREADY to 0x1,
       and the value 0x1 indicates that output of DLL circuit is ready. */
    while (SPIM_GET_DLLREADY(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    /* Set this valid delay number to control register DLL_DNUM. */
    SPIM_SET_DLLDLY_NUM(spim, u32DelayNum);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling DLL status register DLL_REF to 1
       to know the updating flow of DLL delay step number is finish or not. */
    while (SPIM_GET_DLLREF(spim) != 0)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

/** @} end of group SPIM_EXPORTED_FUNCTIONS */
/** @} end of group SPIM_Driver */
/** @} end of group Standard_Driver */
